In [1]:
import pandas as pd

In [8]:
temperature_trichy=pd.Series([34.3,40.5,33.4,41.4,32.6,37.3,31.3])

In [9]:
temperature_trichy #showing series

0    34.3
1    40.5
2    33.4
3    41.4
4    32.6
5    37.3
6    31.3
dtype: float64

In [10]:
temperature_trichy[1] #2nd day temperature

40.5

In [11]:
temperature_trichy[temperature_trichy>40] #temperature above 40

1    40.5
3    41.4
dtype: float64

In [12]:
student=[[1,'tom','1msc'],[2,'jerry','2msc'],[3,'tomy','3bsc']]

In [14]:
df_stud=pd.DataFrame(student, columns=['rollno','name','class'])

In [15]:
df_stud #showing data frame

   rollno   name class
0       1    tom  1msc
1       2  jerry  2msc
2       3   tomy  3bsc

In [16]:
df_stud.columns #showing column names

Index(['rollno', 'name', 'class'], dtype='object')

In [17]:
df_stud['address']=['thillai nagar','woraiyur','lingam nagar'] #adding address

In [18]:
df_stud

   rollno   name class        address
0       1    tom  1msc  thillai nagar
1       2  jerry  2msc       woraiyur
2       3   tomy  3bsc   lingam nagar

In [19]:
phonebook={"tom":[9344467155,'tom@gmail.com'],"jerry":[9344467166,'jerry@gmail.com'],"tommy":[9344467177,"tommy@gmail.com"]}

In [21]:
df_phonebook=pd.DataFrame.from_dict(phonebook, orient='index',columns=['mobile','email'])

In [22]:
df_phonebook #showing phone book

           mobile            email
tom    9344467155    tom@gmail.com
jerry  9344467166  jerry@gmail.com
tommy  9344467177  tommy@gmail.com

In [25]:
review=pd.read_csv("ign.csv")

In [26]:
review.head() #show top 5 rows from ign

,Unnamed: 0,score_phrase,title,url,platform,score,genre,editors_choice,release_year,release_month,release_day
0,0,Amazing,LittleBigPlanet PS Vita,/games/littlebigplanet-vita/vita-98907,PlayStation Vita,9.0,Platformer,Y,2012,9,12
1,1,Amazing,LittleBigPlanet PS Vita -- Marvel Super Hero E...,/games/littlebigplanet-ps-vita-marvel-super-he...,PlayStation Vita,9.0,Platformer,Y,2012,9,12
2,2,Great,Splice: Tree of Life,/games/splice/ipad-141070,iPad,8.5,Puzzle,N,2012,9,12
3,3,Great,NHL 13,/games/nhl-13/xbox-360-128182,Xbox 360,8.5,Sports,N,2012,9,11
4,4,Great,NHL 13,/games/nhl-13/ps3-128181,PlayStation 3,8.5,Sports,N,2012,9,11

In [27]:
review.tail(3) #show bottom 3 rows

,Unnamed: 0,score_phrase,title,url,platform,score,genre,editors_choice,release_year,release_month,release_day
18622,18622,Mediocre,Star Ocean: Integrity and Faithlessness,/games/star-ocean-5/ps4-20035681,PlayStation 4,5.8,RPG,N,2016,6,28
18623,18623,Masterpiece,Inside,/games/inside-playdead/xbox-one-121435,Xbox One,10.0,Adventure,Y,2016,6,28
18624,18624,Masterpiece,Inside,/games/inside-playdead/pc-20055740,PC,10.0,Adventure,Y,2016,6,28

In [30]:
review.shape #how many rows and columns here

(18625, 11)

SyntaxError: invalid syntax (3492301414.py, line 1)